tutorials/shockFluid/diffuserIntake/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

omegaInitial 1;

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaInitial;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.00575;
        value           uniform $omegaInitial;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform $omegaInitial;
        value           uniform $omegaInitial;
    }

    wall
    {
        type            omegaWallFunction;
        value           uniform $omegaInitial;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
